## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/1524496a-597a-4548-9d1e-166b53f1d992).

This is a **layered run** with 1 layers remaining to apply.  Layered runs require multiple rounds of planning and applying.  After applying this layer, comment `terrateam plan` to plan the next layer and continue until all layers are applied.

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/services | Success :thumbsup:
**Dir**: layers/services
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpenvivmj3/plan`

```diff

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service has changed
!   resource "akash_deployment" "service" {
        id                            = "19248794:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
!       services                      = [
!           {
                name               = "renterd-bus-dev-88c8cafe"
!               ready_replicas     = 0 -> 1
                # (8 unchanged attributes hidden)
            },
        ]
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # cloudflare_dns_record.renterd_autopilot will be created
+   resource "cloudflare_dns_record" "renterd_autopilot" {
+       comment_modified_on = (known after apply)
+       content             = (known after apply)
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "autopilot.test-svc.node.testing.pinner.xyz"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "***"
    }

  # cloudflare_dns_record.renterd_workers[0] will be created
+   resource "cloudflare_dns_record" "renterd_workers" {
+       comment_modified_on = (known after apply)
+       content             = (known after apply)
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "worker.test-svc.node.testing.pinner.xyz"
+       proxiable           = (known after apply)
+       proxied             = false
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "***"
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   renterd       = {
+       autopilot = {
+           endpoint = "autopilot.test-svc.node.testing.pinner.xyz"
        }
+       bus       = {
+           endpoint = "bus.test-svc.node.testing.pinner.xyz"
        }
+       workers   = [
+           {
+               dns_fqdn  = "worker.test-svc.node.testing.pinner.xyz"
+               host      = (known after apply)
+               id        = (known after apply)
+               port      = 80
+               worker_id = 1
            },
        ]
    }

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
